4ops.terraform
alancole.gherkintablealign
alefragnani.project-manager
alexkrechik.cucumberautocomplete
aravindkumar.gherkin-indent
ban.spellright
bryan-elliott.show-in-github
christian-kohler.path-intellisense
donjayamanne.githistory
eamodio.gitlens
editorconfig.editorconfig
emeraldwalk.runonsave
fosshaas.fontsize-shortcuts
ginfuru.ginfuru-better-solarized-dark-theme
github.vscode-github-actions
github.vscode-pull-request-github
hashicorp.terraform
marcosvfranco.cucumberautocomplete-behat
mechatroner.rainbow-csv
mhutchie.git-graph
mikoz.isort-formatter
mohsen1.prettify-json
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
njpwerner.autodocstring
oderwat.indent-rainbow
ryanolsonx.solarized
sodatea.velocity
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
supermaven.supermaven
tamasfe.even-better-toml
techer.open-in-browser
tyriar.sort-lines
vscode-icons-team.vscode-icons
yzhang.dictionary-completion
yzhang.markdown-all-in-one
