tap "anchore/grype"
tap "common-fate/granted"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "skyscanner/tools"
tap "withgraphite/tap"
brew "act"
brew "actionlint"
brew "atuin"
brew "automake"
brew "readline"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "openjdk"
brew "dependency-check"
brew "docker"
brew "docker-buildx"
brew "dos2unix"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-secrets"
brew "gitleaks"
brew "gnupg"
brew "golangci-lint"
brew "python@3.12"
brew "librsvg"
brew "graphviz"
brew "grype"
brew "jq"
brew "just"
brew "lefthook"
brew "libmagic"
brew "ls-lint"
brew "maven"
brew "microplane"
brew "node"
brew "node@22"
brew "openssl@1.1"
brew "opentofu"
brew "pinact"
brew "pipx"
brew "pkgconf"
brew "podman"
brew "poetry"
brew "prettier"
brew "pyenv"
brew "python@3.9"
brew "pyupgrade"
brew "qemu"
brew "ripgrep"
brew "ruby"
brew "ruff"
brew "rust"
brew "shfmt"
brew "stow"
brew "syft"
brew "thefuck"
brew "uv"
brew "zizmor"
brew "zlib"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "common-fate/granted/granted"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
brew "jesseduffield/lazygit/lazygit"
brew "skyscanner/tools/turbolift"
brew "withgraphite/tap/graphite"
cask "applite"
cask "devtoys"
cask "ghostty"
cask "git-credential-manager"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "iterm2"
cask "meetingbar"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "warp"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alancole.gherkintablealign"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkrechik.cucumberautocomplete"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "arahata.linter-actionlint"
vscode "aravindkumar.gherkin-indent"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "ban.spellright"
vscode "bogem.bogems-night-owl"
vscode "bradlc.vscode-tailwindcss"
vscode "bryan-elliott.show-in-github"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "chinchiheather.vscode-margin-colours"
vscode "christian-kohler.path-intellisense"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "elijah-potter.harper"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "fnando.linter"
vscode "fosshaas.fontsize-shortcuts"
vscode "foxundermoon.shell-format"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphite.gti-vscode"
vscode "hashicorp.terraform"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "htmlhint.vscode-htmlhint"
vscode "marcosvfranco.cucumberautocomplete-behat"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikoz.isort-formatter"
vscode "million.million-lint"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nefrob.vscode-just-syntax"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.solarized"
vscode "samwillis.python-inline-source"
vscode "sodatea.velocity"
vscode "sonarsource.sonarlint-vscode"
vscode "stevejpurves.cucumber"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.quokka-vscode"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
