tap "anchore/grype"
tap "common-fate/granted"
tap "go-task/tap"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "peak/tap"
tap "skyscanner/tools"
tap "steipete/tap"
tap "withgraphite/tap"
brew "act"
brew "automake"
brew "python@3.13"
brew "awscli"
brew "bash"
brew "bat"
brew "checkov"
brew "cmake"
brew "coreutils"
brew "dependency-check"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "editorconfig-checker"
brew "eza"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "gnupg@1.4"
brew "librsvg"
brew "graphviz"
brew "grype"
brew "jq"
brew "just"
brew "libmagic"
brew "libxml2"
brew "libxslt"
brew "make"
brew "zlib"
brew "mysql-client"
brew "mysql@8.0"
brew "pinact"
brew "pkgconf"
brew "pre-commit"
brew "prek"
brew "prettier"
brew "python@3.11"
brew "python@3.12"
brew "pyupgrade"
brew "qemu"
brew "ripgrep"
brew "stow"
brew "telnet"
brew "terraform-docs"
brew "terraformer"
brew "tfenv"
brew "tflint"
brew "tfsort"
brew "thefuck"
brew "tree"
brew "trivy"
brew "uv"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "common-fate/granted/granted"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform", link: false
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "peak/tap/s5cmd"
brew "withgraphite/tap/graphite"
cask "applite"
cask "dbeaver-community"
cask "devtoys"
cask "docker-desktop"
cask "font-fira-code"
cask "ghostty"
cask "git-credential-manager"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "loop"
cask "meetingbar"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "obsidian"
cask "steipete/tap/repobar"
cask "visual-studio-code"
cask "warp"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "alancole.gherkintablealign"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkrechik.cucumberautocomplete"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "arahata.linter-actionlint"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bogem.bogems-night-owl"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bryan-elliott.show-in-github"
vscode "cameron.vscode-pytest"
vscode "captainstack.captain-stack"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "chinchiheather.vscode-margin-colours"
vscode "chrischinchilla.vale-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clemenspeters.format-json"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "designbyajay.typescript-snippets"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "doublevkay.codeql-agent"
vscode "dracula-theme.theme-dracula"
vscode "dskwrk.vscode-generate-getter-setter"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "elijah-potter.harper"
vscode "eliverlara.andromeda"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "eshojaei.mbake-makefile-formatter"
vscode "ffaraone.pyfilesgen"
vscode "fnando.linter"
vscode "formulahendry.code-runner"
vscode "fosshaas.fontsize-shortcuts"
vscode "foxundermoon.shell-format"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot-chat"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "graphite.gti-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "iliazeus.vscode-ansi"
vscode "infeng.vscode-react-typescript"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ivory-lab.jenkinsfile-support"
vscode "jalisimo.react-jest-vscode-snippets"
vscode "jebbs.plantuml"
vscode "jmredfern.sort-delimited-list"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "kevinrose.vsc-python-indent"
vscode "liviuschera.noctis"
vscode "marabesi.php-import-checker"
vscode "marcosvfranco.cucumberautocomplete-behat"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miclo.sort-typescript-imports"
vscode "mikoz.isort-formatter"
vscode "mkhl.shfmt"
vscode "mnxn.jvm-bytecode-viewer"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mushan.vscode-paste-image"
vscode "nefrob.vscode-just-syntax"
vscode "nicholashsiang.vscode-javascript-comment"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "oliversturm.fix-json"
vscode "owenrumney.tf-nav"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "paulshen.paul-typescript-toolkit"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ryanolsonx.solarized"
vscode "salbert.comment-ts"
vscode "samwillis.python-inline-source"
vscode "scala-lang.scala"
vscode "sdras.night-owl"
vscode "sebastienfi.dead-code-finder"
vscode "smlombardi.slime"
vscode "sodatea.velocity"
vscode "sonarsource.sonarlint-vscode"
vscode "stevejpurves.cucumber"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tfsec.tfsec"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "topppy.tsdoc-insert"
vscode "trailofbits.sarif-explorer"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "vsls-contrib.gistfs"
vscode "vtenentes.bdd"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wesbos.theme-cobalt2"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
